tests/doseUnsteadyBox/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | radiationDose unsteady-mode regression          |
|  \\    /   O peration     |                                                 |
|   \\  /    A nd           |                                                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

// Uniform plug flow. Slip walls (below) hold the bulk value
// everywhere; the laminar momentum solve advances U but with no
// forcing and matched inlet/outlet velocities the field stays
// at (0.5, 0, 0) throughout. Identical analytical residence time
// L/V = 2 s and dose 2.0 mJ/cm^2 as the steady-mode doseSmokeBox.
internalField   uniform (0.5 0 0);

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform (0.5 0 0);
    }
    outlet
    {
        type            zeroGradient;
    }
    walls
    {
        type            slip;
    }
}

// ************************************************************************* //
